---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.SlantedColumnEndPlanesHaveFlipped
source: html/92532b91-a865-9d9b-3102-922737468e7f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.SlantedColumnEndPlanesHaveFlipped Property

Position of end cut planes has resulted in a slanted column without any geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId SlantedColumnEndPlanesHaveFlipped { get; }
```